Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/4.2.130/atdf/ATSAML11E14A.atdf
        <register name="DPIDR4" offset="0x20" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="DPIDR5" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 5">
        </register>
        <register name="DPIDR6" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 6">
        </register>
        <register name="DPIDR7" offset="0x2C" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 7">
        </register>
        <register name="DPIDR0" offset="0x30" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="DPIDR1" offset="0x34" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="DPIDR2" offset="0x38" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="DPIDR3" offset="0x3C" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="DCIDR0" offset="0x40" rw="R" size="4" access-size="4" initval="0x0000000D" caption="SCS Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="DCIDR1" offset="0x44" rw="R" size="4" access-size="4" initval="0x00000090" caption="SCS Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="DCIDR2" offset="0x48" rw="R" size="4" access-size="4" initval="0x00000005" caption="SCS Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="DCIDR3" offset="0x4C" rw="R" size="4" access-size="4" initval="0x000000B1" caption="SCS Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DIB_DLAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
      <value-group name="DIB_DAUTHSTATUS__NSID">
        <value name="NO" caption="Non-secure invasive debug prohibited" value="2"/>
        <value name="YES" caption="Non-secure invasive debug allowed" value="3"/>
      </value-group>
      <value-group name="DIB_DAUTHSTATUS__NSNID">
        <value name="NO" caption="Non-secure non-invasive debug prohibited" value="2"/>
        <value name="YES" caption="Non-secure non-invasive debug allowed" value="3"/>
      </value-group>
      <value-group name="DIB_DAUTHSTATUS__SID">
        <value name="NOSEC" caption="Security Extension not implemented" value="0"/>
        <value name="NO" caption="Secure invasive debug prohibited" value="2"/>
        <value name="YES" caption="Secure invasive debug allowed" value="3"/>
      </value-group>
      <value-group name="DIB_DAUTHSTATUS__SNID">
        <value name="NOSEC" caption="Security Extension not implemented" value="0"/>
        <value name="NO" caption="Secure non-invasive debug prohibited" value="2"/>
        <value name="YES" caption="Secure non-invasive debug allowed" value="3"/>
      </value-group>
    </module>
    <module name="DWT" version="1.0.0" caption="Data Watchpoint and Trace">
      <register-group name="COMPARATOR" size="0x10">
        <register name="DWT_COMP" offset="0x0" rw="RW" size="4" access-size="4" caption="DWT Comparator Register n">
          <bitfield name="VALUE" caption="Cycle/PC/data value or data address" mask="0xFFFFFFFF"/>
        </register>
        <register name="DWT_FUNCTION" offset="0x8" rw="RW" size="4" access-size="4" caption="DWT Function Register x">
          <bitfield name="MATCH" caption="Match type" mask="0xF"/>
          <bitfield name="ACTION" caption="Action on match" mask="0x30"/>
          <bitfield name="DATAVSIZE" caption="Data value size" mask="0xC00"/>
          <bitfield name="MATCHED" caption="Comparator matched" mask="0x1000000"/>
          <bitfield name="ID" caption="Identify capability" mask="0xF8000000"/>
        </register>
      </register-group>
      <register-group name="DWT" caption="Data Watchpoint and Trace">
        <register name="DWT_CTRL" offset="0x0" rw="RW" size="4" access-size="4" initval="0x0B000000" caption="DWT Control Register">
          <bitfield name="CYCCNTENA" caption="CYCCNT enable" mask="0x1"/>
          <bitfield name="POSTPRESET" caption="POSTCNT preset" mask="0x1E"/>
          <bitfield name="POSTINIT" caption="POSTCNT initial" mask="0x1E0"/>
          <bitfield name="CYCTAP" caption="Cycle count tap" mask="0x200"/>
          <bitfield name="SYNCTAP" caption="Synchronization tap" mask="0xC00"/>
          <bitfield name="PCSAMPLENA" caption="PC sample enable" mask="0x1000"/>
          <bitfield name="EXCTRCENA" caption="Exception trace enable" mask="0x10000"/>
          <bitfield name="CPIEVTENA" caption="CPI event enable" mask="0x20000"/>
          <bitfield name="EXCEVTENA" caption="Exception event enable" mask="0x40000"/>
          <bitfield name="SLEEPEVTENA" caption="Sleep event enable" mask="0x80000"/>
          <bitfield name="LSUEVTENA" caption="LSU event enable" mask="0x100000"/>
          <bitfield name="FOLDEVTENA" caption="Fold event enable" mask="0x200000"/>
          <bitfield name="CYCEVTENA" caption="Cycle event enable" mask="0x400000"/>
          <bitfield name="CYCDISS" caption="Cycle counter disabled secure" mask="0x800000"/>
          <bitfield name="NOPRFCNT" caption="No profile counters" mask="0x1000000"/>
          <bitfield name="NOCYCCNT" caption="No cycle count" mask="0x2000000"/>
          <bitfield name="NOEXTTRIG" caption="No external triggers" mask="0x4000000"/>
          <bitfield name="NOTRCPKT" caption="No trace packets" mask="0x8000000"/>
          <bitfield name="NUMCOMP" caption="Number of comparators" mask="0xF0000000"/>
        </register>
        <register name="DWT_PCSR" offset="0x1C" rw="R" size="4" access-size="4" caption="DWT Program Counter Sample Register">
          <bitfield name="EIASAMPLE" caption="Executed instruction address sample" mask="0xFFFFFFFF"/>
        </register>
        <register-group name="COMPARATOR" name-in-module="COMPARATOR" offset="0x020" size="0x10" count="2"/>
